In [1]:
import pandas as pd
import numpy as np

/home/kira/anaconda3/lib/python3.7/site-packages/setuptools/_importlib.py:42: SetuptoolsWarning: Incompatibility problem.
!!

        ********************************************************************************
        `importlib-metadata` version is incompatible with `setuptools`.
        This problem is likely to be solved by installing an updated version of
        `importlib-metadata`.

        See https://github.com/python/importlib_metadata/issues/396 for details.
        ********************************************************************************

!!
  disable_importlib_metadata_finder(metadata)

In [2]:

# Gerar um DataFrame com números aleatórios distribuídos normalmente
df = pd.DataFrame(np.random.randn(5, 4), index=['A', 'B', 'C', 'D', 'E'], columns=['w', 'x', 'y', 'z'])

In [3]:
#tabela gerada
df

          w         x         y         z
A  0.171702 -0.665883  0.255742  0.362961
B -0.433372 -0.114081 -0.328354 -0.071494
C  0.844864 -0.319352  0.588023  0.475316
D -0.914981  0.034329 -0.073322  0.695838
E  1.057081  1.197992 -0.062500 -1.016018

In [4]:
#
df[['w','z']]

          w         z
A  0.171702  0.362961
B -0.433372 -0.071494
C  0.844864  0.475316
D -0.914981  0.695838
E  1.057081 -1.016018

In [5]:
#atribuiçao de valor 
df['new']= df['w']

In [6]:
df

          w         x         y         z       new
A  0.171702 -0.665883  0.255742  0.362961  0.171702
B -0.433372 -0.114081 -0.328354 -0.071494 -0.433372
C  0.844864 -0.319352  0.588023  0.475316  0.844864
D -0.914981  0.034329 -0.073322  0.695838 -0.914981
E  1.057081  1.197992 -0.062500 -1.016018  1.057081

In [7]:
#acessar as linhas, por indece
df.loc['A']

w      0.171702
x     -0.665883
y      0.255742
z      0.362961
new    0.171702
Name: A, dtype: float64

In [8]:
#posso acessar usando numeros
df.iloc[1,2]

-0.328354050707204

In [9]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [10]:
df.columns

Index(['w', 'x', 'y', 'z', 'new'], dtype='object')

In [11]:
#cria uma coluna porem n altera o df original 
df.reset_index()

  index         w         x         y         z       new
0     A  0.171702 -0.665883  0.255742  0.362961  0.171702
1     B -0.433372 -0.114081 -0.328354 -0.071494 -0.433372
2     C  0.844864 -0.319352  0.588023  0.475316  0.844864
3     D -0.914981  0.034329 -0.073322  0.695838 -0.914981
4     E  1.057081  1.197992 -0.062500 -1.016018  1.057081

In [12]:
df

          w         x         y         z       new
A  0.171702 -0.665883  0.255742  0.362961  0.171702
B -0.433372 -0.114081 -0.328354 -0.071494 -0.433372
C  0.844864 -0.319352  0.588023  0.475316  0.844864
D -0.914981  0.034329 -0.073322  0.695838 -0.914981
E  1.057081  1.197992 -0.062500 -1.016018  1.057081

In [13]:
#para alterar o df original 
df.reset_index(inplace=True)

In [14]:
df

  index         w         x         y         z       new
0     A  0.171702 -0.665883  0.255742  0.362961  0.171702
1     B -0.433372 -0.114081 -0.328354 -0.071494 -0.433372
2     C  0.844864 -0.319352  0.588023  0.475316  0.844864
3     D -0.914981  0.034329 -0.073322  0.695838 -0.914981
4     E  1.057081  1.197992 -0.062500 -1.016018  1.057081

In [15]:
#e agora pra voltar o original e tirar o  index
df.set_index("index",inplace=True)

In [16]:
df

              w         x         y         z       new
index
A      0.171702 -0.665883  0.255742  0.362961  0.171702
B     -0.433372 -0.114081 -0.328354 -0.071494 -0.433372
C      0.844864 -0.319352  0.588023  0.475316  0.844864
D     -0.914981  0.034329 -0.073322  0.695838 -0.914981
E      1.057081  1.197992 -0.062500 -1.016018  1.057081

 # Tratamento de numero vazios no df

In [17]:
#so gerando um  df com numero vazios para poder  trabalhar  os numeoros vazios 
df_teste= pd.DataFrame({'A': [1,2,np.nan],
          'B': [5,np.nan,np.nan],
          'C': [1,2,3]
          })

In [18]:
df_teste

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
#agora eu vou tratar esses numeros varios removendo os nan
df_teste.dropna()

     A    B  C
0  1.0  5.0  1

ou seja ele deleta todas as linhasa que tem NaN e deixa so a unica que n contem numeros vazios

In [20]:
# fazendo a mesma coisa,porem agora com colunas 
df_teste.dropna(axis=1)

   C
0  1
1  2
2  3

In [21]:
df_teste.dropna(axis=1 , thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [22]:
#esse metodo substitui todos os valores NaN pelo valo que vc passar dentro do aprentese ,
#geralmente usamos 0
df_teste.fillna('0')

   A  B  C
0  1  5  1
1  2  0  2
2  0  0  3

In [23]:
#tambem podemos colocar a media do valor dele  para substituir ,
# em alguns casos isso pode ser bem ultio pos n iria alterr muita cosia 
df_teste['A'].mean()
#aqui tiramos a media de toda a coluna A

1.5

In [24]:
df_teste['A'].fillna(value=df_teste['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [25]:
#substitui  o valor em cima do NaN  
df_teste.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [26]:
#ele joga o valor de baixo pra NaN porem n via funcionar agora pq n temos valor em baixo
df_teste.bfill()

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# Groupby

In [27]:
#criando o DF
data = {'Classe':['Júnior','Júnior','Pleno','Pleno','Senior','Senior'],
        'Nome':['Júnior','Carlo','Eliane','janice','fonseca','vera'],
        'Venda':['200','130','240','156','220','145']}

In [28]:
df =  pd.DataFrame(data)

In [29]:
df

   Classe     Nome Venda
0  Júnior   Júnior   200
1  Júnior    Carlo   130
2   Pleno   Eliane   240
3   Pleno   janice   156
4  Senior  fonseca   220
5  Senior     vera   145

In [30]:
group = df.groupby("Classe")

In [31]:
# Convertendo a coluna "Venda" para o tipo numérico
df['Venda'] = pd.to_numeric(df['Venda'])

In [32]:
group.sum()

        Venda
Classe
Júnior    330
Pleno     396
Senior    365

In [33]:
group.mean()

        Venda
Classe
Júnior  165.0
Pleno   198.0
Senior  182.5

In [34]:
group.min()

           Nome  Venda
Classe
Júnior    Carlo    130
Pleno    Eliane    156
Senior  fonseca    145

In [35]:
df2= df

In [36]:
df

   Classe     Nome  Venda
0  Júnior   Júnior    200
1  Júnior    Carlo    130
2   Pleno   Eliane    240
3   Pleno   janice    156
4  Senior  fonseca    220
5  Senior     vera    145

# Operaçoes no Pandas

In [37]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[123,212,332,45],
                   'col3':['sas','asa','add','pqw']})
df.head()

   col1  col2 col3
0     1   123  sas
1     2   212  asa
2     3   332  add
3     4    45  pqw

In [38]:
#informaçoes do df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
col1    4 non-null int64
col2    4 non-null int64
col3    4 non-null object
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [39]:
#ver a memoria dele 
df.memory_usage()

Index    80
col1     32
col2     32
col3     32
dtype: int64

In [40]:
#seleciona todo os valos unicos de uma coluna espesifica que vc queira usar 
df['col2'].unique()

array([123, 212, 332,  45])

In [41]:
#o tamanho desses valores unicos , ou seja quantas itens dessa coluna tem valores unicos 
df['col2'].nunique()

4

In [42]:
#ele misturas os dois de cima ele vai te trazer quais sao os valores unicos 
#e quantas vezes ele se repete
df['col2'].value_counts()

332    1
212    1
123    1
45     1
Name: col2, dtype: int64

In [43]:
5*6*7

210

In [44]:
df

   col1  col2 col3
0     1   123  sas
1     2   212  asa
2     3   332  add
3     4    45  pqw

In [45]:
df['col1'].product()

24

In [46]:
tabela = pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                   'col2':[1,2,3,4,5,6,7,8,9,10]
                   })

In [47]:
tabela['col1'].std()

3.0276503540974917

# Dados Temporais

In [55]:
numero_dias = 100

In [56]:
datas =  pd.date_range(start='1/1/2021',periods=numero_dias)

In [57]:
datas

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19', '2021-02-20', '2021-02-21',
               '2021-02-22', '2021-02-23', '2021-02-24', '2021-02-25',
               '2021-02-26', '2021-02-27', '2021-02-28', '2021-03-01',
               '2021-03-02', '2021-03-03', '2021-03-04', '2021-03-05',
               '2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21',
               '2021-03-22', '2021-03-23', '2021-03-24', '2021-03-25',
               '2021-03-26', '2021-03-27', '2021-03-28', '2021-03-29',
               '2021-03-30', '2021-03-31', '2021-04-01', '2021-04-02',
               '2021-04-03', '2021-04-04', '2021-04-05', '2021-04-06',
               '2021-04-07', '2021-04-08', '2021-04-09', '2021-04-10'],
              dtype='datetime64[ns]', freq='D')

In [61]:
df = pd.DataFrame(range(numero_dias), columns=['number'],index=datas)
model.fit(np.array(train_X),np.array(train_Y), epochs=20, batch_size=10)

AttributeError: 'range' object has no attribute 'ndim'

In [63]:
#077 02:44

# Entrada e saida de arquivo

https://pandas.pydata.org/docs/user_guide/io.html

In [ ]:
df1 = pd.read_csv()

In [ ]:
#81